# 4.6.1 Combining and Exporting Data Task
## 4.6.1.0 Initialization
## 4.6.1.1 Path Setup and Import
## 4.6.1.2 Merge Process

## 4.6.1.0 Initialization

In [2]:
import pandas as pd
import numpy as np
import os

## 4.6.1.1 Path Setup and Import

In [3]:
path = '/Users/matthewmacbook/Documents/CareerFoundry/Data Immersion/Achievement 4 - Python Fundamentals for Data Analysts/Instacart Basket Analysis 26-07-2023'

In [4]:
df_ords_prods_comb = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [5]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

## 4.6.1.2 Merge Process

In [6]:
df_ords_prods_comb.shape

(32434489, 11)

In [7]:
df_prods.shape

(49672, 5)

In [8]:
df_ords_prods_comb.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [13]:
# create list of headers without indicator column
ords_prods_comb_headers = ['order_id', 'user_id', 'order_number', 'orders_day_of_week', 'order_hour_of_day', 'days_since_prior_order', 'first_order', 'product_id', 'add_to_cart_order', 'reordered']

In [16]:
# new dataframe of previous data frame without indicator column
df_ords_prods_comb_no_indicator = df_ords_prods_comb[ords_prods_comb_headers]

In [9]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [17]:
# merge orders data frame with products data frame and show indicator column
orders_products_merged = df_ords_prods_comb_no_indicator.merge(df_prods, on = 'product_id', indicator = True)

In [18]:
# check that new data frame has the appropriate columns
orders_products_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,both

In [20]:
# check to see if the merge was done in full
orders_products_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

full merge was complete

In [19]:
orders_products_merged.shape

(32404859, 15)

## 4.6.1.3 Export Process

In [21]:
# export newly merged data frame as pkl file
orders_products_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))